<?php
/**
 * 省份城市
*/
class TTCity{
	/*返回省市*/
	public static function getCityMap() {
		$cityMap = '{"1":{"name":"北京市","city":{"100":"北京市"}},"2":{"name":"天津市","city":{"200":"天津市"}},"3":{"name":"河北省","city":{"300":"其他","301":"石家庄市","302":"唐山市","303":"秦皇岛市","304":"邯郸市","305":"邢台市","306":"保定市","307":"张家口市","308":"承德市","309":"沧州市","310":"廊坊市","311":"衡水市"}},"4":{"name":"山西省","city":{"400":"其他","401":"太原市","402":"大同市","403":"阳泉市","404":"长治市","405":"晋城市","406":"朔州市","407":"晋中市","408":"运城市","409":"忻州市","410":"临汾市","411":"吕梁市"}},"5":{"name":"内蒙古","city":{"500":"其他","501":"呼和浩特市","502":"包头市","503":"乌海市","504":"赤峰市","505":"通辽市","506":"鄂尔多斯市","507":"呼伦贝尔市","508":"巴彦淖尔市","509":"乌兰察布市","510":"锡林郭勒盟","511":"阿拉善盟","512":"兴安盟"}},"6":{"name":"江苏省","city":{"600":"其他","601":"南京市","602":"无锡市","603":"徐州市","604":"常州市","605":"苏州市","606":"南通市","607":"连云港市","608":"淮安市","609":"盐城市","610":"扬州市","611":"镇江市","612":"泰州市","613":"宿迁市"}},"7":{"name":"安徽省","city":{"700":"其他","701":"合肥市","702":"芜湖市","703":"蚌埠市","704":"淮南市","705":"马鞍山市","706":"淮北市","707":"铜陵市","708":"安庆市","709":"黄山市","710":"滁州市","711":"阜阳市","712":"宿州市","713":"巢湖市","714":"六安市","715":"亳州市","716":"池州市","717":"宣城市"}},"8":{"name":"山东省","city":{"800":"其他","801":"济南市","802":"青岛市","803":"淄博市","804":"枣庄市","805":"东营市","806":"潍坊市","807":"烟台市","808":"威海市","809":"济宁市","810":"泰安市","811":"日照市","812":"莱芜市","813":"临沂市","814":"德州市","815":"聊城市","816":"滨州市","817":"菏泽市"}},"9":{"name":"辽宁省","city":{"900":"其他","901":"沈阳市","902":"大连市","903":"鞍山市","904":"抚顺市","905":"本溪市","906":"丹东市","907":"锦州市","908":"营口市","909":"阜新市","910":"辽阳市","911":"盘锦市","912":"铁岭市","913":"朝阳市","914":"葫芦岛市"}},"10":{"name":"吉林省","city":{"1000":"其他","1001":"长春市","1002":"吉林市","1003":"四平市","1004":"辽源市","1005":"通化市","1006":"白山市","1007":"松原市","1008":"白城市","1009":"延边州"}},"11":{"name":"黑龙江省","city":{"1100":"其他","1101":"哈尔滨市","1102":"齐齐哈尔市","1103":"鸡西市","1104":"鹤岗市","1105":"双鸭山市","1106":"大庆市","1107":"伊春市","1108":"牡丹江市","1109":"佳木斯市","1110":"七台河市","1111":"黑河市","1112":"绥化市","1113":"大兴安岭地区"}},"12":{"name":"上海市","city":{"1200":"上海市"}},"13":{"name":"浙江省","city":{"1300":"其他","1301":"杭州市","1302":"宁波市","1303":"温州市","1304":"嘉兴市","1305":"湖州市","1306":"绍兴市","1307":"金华市","1308":"衢州市","1309":"舟山市","1310":"台州市","1311":"丽水市"}},"14":{"name":"江西省","city":{"1400":"其他","1401":"南昌市","1402":"景德镇市","1403":"萍乡市","1404":"九江市","1405":"新余市","1406":"鹰潭市","1407":"赣州市","1408":"吉安市","1409":"宜春市","1410":"抚州市","1411":"上饶市"}},"15":{"name":"福建省","city":{"1500":"其他","1501":"福州市","1502":"厦门市","1503":"莆田市","1504":"三明市","1505":"泉州市","1506":"漳州市","1507":"南平市","1508":"龙岩市","1509":"宁德市"}},"16":{"name":"湖北省","city":{"1600":"其他","1601":"武汉市","1602":"黄石市","1603":"襄樊市","1604":"十堰市","1605":"荆州市","1606":"宜昌市","1607":"荆门市","1608":"鄂州市","1609":"孝感市","1610":"黄冈市","1611":"咸宁市","1612":"随州市","1613":"恩施州","1614":"仙桃市","1615":"天门市","1616":"潜江市","1617":"神农架林区"}},"17":{"name":"湖南省","city":{"1700":"其他","1701":"长沙市","1702":"株洲市","1703":"湘潭市","1704":"衡阳市","1705":"邵阳市","1706":"岳阳市","1707":"常德市","1708":"张家界市","1709":"益阳市","1710":"郴州市","1711":"永州市","1712":"怀化市","1713":"娄底市","1714":"湘西州"}},"18":{"name":"河南省","city":{"1800":"其他","1801":"郑州市","1802":"开封市","1803":"洛阳市","1804":"平顶山市","1805":"焦作市","1806":"鹤壁市","1807":"新乡市","1808":"安阳市","1809":"濮阳市","1810":"许昌市","1811":"漯河市","1812":"三门峡市","1813":"南阳市","1814":"商丘市","1815":"信阳市","1816":"周口市","1817":"驻马店市","1818":"济源市"}},"19":{"name":"广东省","city":{"1900":"其他","1901":"广州市","1902":"深圳市","1903":"珠海市","1904":"汕头市","1905":"韶关市","1906":"河源市","1907":"梅州市","1908":"惠州市","1909":"汕尾市","1910":"东莞市","1911":"中山市","1912":"江门市","1913":"佛山市","1914":"阳江市","1915":"湛江市","1916":"茂名市","1917":"肇庆市","1918":"清远市","1919":"潮州市","1920":"揭阳市","1921":"云浮市"}},"20":{"name":"广西省","city":{"2000":"其他","2001":"南宁市","2002":"柳州市","2003":"桂林市","2004":"梧州市","2005":"北海市","2006":"防城港市","2007":"钦州市","2008":"贵港市","2009":"玉林市","2010":"百色市","2011":"贺州市","2012":"河池市","2013":"来宾市","2014":"崇左市"}},"21":{"name":"海南省","city":{"2100":"其他","2101":"海口市","2102":"三亚市","2103":"五指山市","2104":"琼海市","2105":"儋州市","2106":"文昌市","2107":"万宁市","2108":"东方市","2109":"澄迈县","2110":"定安","2111":"屯昌","2112":"临高县","2113":"白沙黎族自治县","2114":"昌江黎族自治县","2115":"乐东黎族自治县","2116":"陵水黎族自治县","2117":"保亭黎族苗族自治县","2118":"琼中黎族苗族自治县"}},"22":{"name":"重庆市","city":{"2200":"重庆市","2201":"永川","2202":"合川","2203":"江津","2204":"南川","2205":"綦江","2206":"潼南","2207":"荣昌","2208":"璧山","2209":"大足","2210":"铜梁","2211":"梁平","2212":"城口","2213":"垫江","2214":"武隆","2215":"丰都","2216":"奉节","2217":"开县","2219":"忠县","2220":"巫溪","2221":"巫山"}},"23":{"name":"四川省","city":{"2300":"其他","2301":"成都市","2302":"自贡市","2303":"攀枝花市","2304":"泸州市","2305":"德阳市","2306":"绵阳市","2307":"广元市","2308":"遂宁市","2309":"内江市","2310":"乐山市","2311":"南充市","2312":"宜宾市","2313":"广安市","2314":"达州市","2315":"眉山市","2316":"雅安市","2317":"巴中市","2318":"资阳市","2319":"阿坝州","2320":"甘孜州","2321":"凉山州"}},"24":{"name":"贵州省","city":{"2400":"其他","2401":"贵阳市","2402":"六盘水市","2403":"遵义市","2404":"安顺市","2405":"铜仁地区","2406":"毕节地区","2407":"黔西南州","2408":"黔东南州","2409":"黔南州"}},"25":{"name":"云南省","city":{"2500":"其他","2501":"昆明市","2502":"曲靖市","2503":"玉溪市","2504":"保山市","2505":"昭通市","2506":"丽江市","2507":"思茅市","2508":"临沧市","2509":"文山州","2510":"红河州","2511":"西双版纳州","2512":"楚雄州","2513":"大理州","2514":"德宏州","2515":"怒江州","2516":"迪庆州"}},"26":{"name":"西藏","city":{"2600":"其他","2601":"拉萨市","2602":"那曲地区","2603":"昌都地区","2604":"山南地区","2605":"日喀则地区","2606":"阿里地区","2607":"林芝地区"}},"27":{"name":"陕西省","city":{"2700":"其他","2701":"西安市","2702":"铜川市","2703":"宝鸡市","2704":"咸阳市","2705":"渭南市","2706":"延安市","2707":"汉中市","2708":"榆林市","2709":"安康市","2710":"商洛市"}},"28":{"name":"甘肃省","city":{"2800":"其他","2801":"兰州市","2802":"金昌市","2803":"白银市","2804":"天水市","2805":"嘉峪关市","2806":"武威市","2807":"张掖市","2808":"平凉市","2809":"酒泉市","2810":"庆阳市","2811":"定西市","2812":"陇南市","2813":"临夏州","2814":"甘南州"}},"29":{"name":"宁夏","city":{"2900":"其他","2901":"银川市","2902":"石嘴山市","2903":"吴忠市","2904":"固原市","2905":"中卫市"}},"30":{"name":"青海省","city":{"3000":"其他","3001":"西宁市","3002":"海东地区","3003":"海北州","3004":"黄南","3005":"海南州","3006":"果洛州","3007":"玉树州","3008":"海西州"}},"31":{"name":"新疆","city":{"3100":"其他","3101":"乌鲁木齐市","3102":"克拉玛依市","3103":"吐鲁番地区","3104":"哈密地区","3105":"和田地区","3106":"阿克苏地区","3107":"喀什地区","3108":"克孜勒苏柯州","3109":"巴音郭楞州","3110":"昌吉州","3111":"博尔塔拉州","3112":"伊犁州","3113":"塔城地区","3114":"阿勒泰地区","3115":"石河子市","3116":"阿拉尔市","3117":"图木舒克","3118":"五家渠"}}}';
		return json_decode($cityMap,true);
    }
	
	
	public static function cityToNum($prov,$city) { 
		$cityMap = TTCity::getCityMap();//需要city类
		$flag=0;
		foreach($cityMap as $k=>$v){
			if($v['name']==$prov){
				$prov = $k;
				$flag=1;
				foreach($v['city'] as $k2=>$v2){
					if($v2==$city){
						$flag=2;
						$city = $k2;
						break;
					}
				}
				if($flag != 2){//标志位，若无此城市则取该省份首个城市
					$city = array_keys($v['city']);
					$city = $city[0];
				}
				break;
			}
		}
		if(!$flag){//标志位
			$prov = 0;
			$city = 0;
		}
		return array('prov'=>$prov,'city'=>$city);
	}
	public static function cityToName($prov,$city) { 
		$cityMap = TTCity::getCityMap();//需要city类
		$flag=0;
		foreach($cityMap as $k=>$v){
			if($k == $prov){
				$prov = $v['name'];
				$flag = 1;
				foreach($v['city'] as $k2=>$v2){
					if($k2 == $city){
						$flag = 2;
						$city = $v2;
						break;
					}
				}
				if($flag != 2){//标志位，若无此城市则取该省份首个城市
					$city = '其他';
				}
				break;
			}
		}
		if(!$flag){//标志位
			$prov = '其他';
			$city = '其他';
		}
		return array('prov'=>$prov,'city'=>$city);
	}

/*
去掉的一部分省份
,"32":{"name":"香港","city":{"3200":"香港"}},"33":{"name":"澳门","city":{"3300":"澳门"}},"34":{"name":"台湾省","city":{"3400":"其他","3401":"台北","3402":"高雄","3403":"台中","3404":"花莲","3405":"基隆","3406":"嘉义","3407":"金门","3408":"连江","3409":"苗栗","3410":"南投","3411":"澎湖","3412":"屏东","3413":"台东","3414":"台南","3415":"桃园","3416":"新竹","3417":"宜兰","3418":"云林","3419":"彰化"}}
*/
}
?>